export const termsData = [
    {
        id: 1,
        term: "Тестирование ",
        intr: "процесс, связанный с планированием, подготовкой и оценкой программных продуктов и связанных с ними рабочих продуктов, чтобы определить, удовлетворяют ли они заданным требованиям, продемонстрировать их соответствие назначению и обнаружить дефекты."
    },
    {
        id:2,
        term: "Функциональное тестирование",
        intr: "тестирование, основанное на анализе спецификации функциональности компонента или системы. "
    },
    {
        id:3,
        term: "Тестирование интерфейса",
        intr: "тип интеграционного тестирования, связанный с тестированием интерфейсов между компонентами или системами."
    },
    {
        id:4,
        term: "Тестирование защищенности",
        intr: "тестирование с целью оценить защищенность программного продукта."
    },
    {
        id:5,
        term: "Разработка тестов методом белого ящика",
        intr: "процедура разработки или выбора тестовых сценариев на основании анализа внутренней структуры компонента или системы."
    },
    {
        id:6,
        term: "Разработка тестов методом черного ящика ",
        intr: "процедура создания и/или выбора тестовых сценариев, основанная на анализе функциональной или нефункциональной спецификации компонента или системы без знания внутренней структуры. "
    },

    {
        id:7,
        term: "Разработка тестов методом серого ящика",
        intr: "специальный метод тестирования программного обеспечения с неполным знанием его внутреннего устройства."
    },

    {
        id:8,
        term: "Нефункциональное тестирование ",
        intr: "тестирование атрибутов компонента или системы, не относящихся к функциональности, то есть надежность, эффективность, практичность, сопровождаемость и переносимость."
    },

    {
        id:9,
        term: "Тестирование переносимости ",
        intr: "процесс тестирования с цельюеделить переносимость программного продукта."
    },

    {
        id:10,
        term: "Тестирование совместимости ",
        intr: "процесс тестирования для определения возможности взаимодействия программного продукта."
    },

    {
        id:11,
        term: "Тестирование производительности",
        intr: "процесс тестирования  целью определить производительность программного продукта."
    },

    {
        id:12,
        term: "Модульное тестирование",
        intr: "это разновидность тестирования в программной разработке, которое заключается в проверке работоспособности отдельных функциональных модулей, процессов или частей кода приложения."
    },

    {
        id:13,
        term: "Интеграционное тестирование",
        intr: "тестирование, выполняемое для обнаружения дефектов в интерфейсах и во взаимодействии между интегрированными компонентами или системами."
    },

    {
        id:14,
        term: "Системное тестирование",
        intr: "процесс тестирования системы в целом с целью проверки того, что она соответствует установленным требованиям."
    },


    {
        id:15,
        term: "BDD ",
        intr: "это процесс разработки программного обеспечения, являющаяся ответвлением от методологии разработки через тестирование (TDD). Разработка, основанная на описании поведения."
    },
    {
        id:16,
        term: "TDD  ",
        intr: "техника разработки программного обеспечения, которая основывается на повторении очень коротких циклов разработки: сначала пишется тест, покрывающий желаемое изменение, затем пишется код, который позволит пройти тест, и под конец проводится рефакторинг нового кода к соответствующим стандартам."
    },
    {
        id:17,
        term: "ATDD  ",
        intr: "это методология разработки, основанная на общении между бизнес-заказчиками, разработчиками и тестировщиками.  ATDD включает в себя многие из тех же практик, что и спецификация на примере (SBE), разработка, основанная на поведении (BDD), разработка на основе примеров (EDD), и поддержка, управляемая разработку также называют разработкой через тестирование историй (SDD). Все эти процессы помогают разработчикам и тестировщикам понять потребности клиента до внедрения и позволяют клиентам общаться на языке своей предметной области."
    },
    {
        id:18,
        term: "Приёмочное тестирование ",
        intr: "формальное тестирование по отношению к потребностям, требованиям и бизнес-процессам пользователя, проводимое с целью определения соответствия системы критериям приёмки."
    },
    {
        id:19,
        term: "Автоматизированное тестирование ",
        intr: "выполнение тестов, реализуемое при помощи заранее записанной последовательности тестов. "
    },
    {
        id:20,
        term: "Ручное тестирование ",
        intr: "это процесс поиска ошибок в программе без использования специальных ПО, силами человека."
    },
    {
        id:21,
        term: "Полуавтоматизированное тестирование ",
        intr: "ручное тестирование с частичным использованием средств автоматизации - программного обеспечения (например, средств захвата/воспроизведения) для контроля выполнения тестов, сравнения полученных результатов с эталонными, установки предусловий тестов и других функций контроля тестирования и организации отчетов."
    },
    {
        id:22,
        term: "Инструмент тестирования",
        intr: "программный продукт, поддерживающий одну или несколько задач тестирования, таких как планирование и контроль, специфицирование, создание изначальных файлов и данных, выполнение и анализ тестов."
    },
   

]